STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E_EVAL/stm32l552e_eval.c
/**
  ******************************************************************************
  * @file    stm32l552e_eval.c
  * @author  MCD Application Team
  * @brief   This file provides set of firmware functions to manage:
  *          - LEDs, push-buttons, potentiometer, joystick and COM ports available
  *            on STM32L552E-EVAL board (MB1372) from STMicroelectronics
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l552e_eval.h"

#if (USE_BSP_COM_FEATURE == 1)
#if (USE_COM_LOG == 1)
#include <stdio.h>
#endif
#endif

/** @addtogroup BSP
  * @{
  */

/** @defgroup STM32L552E_EVAL STM32L552E_EVAL
  * @{
  */

/** @defgroup STM32L552E_EVAL_COMMON STM32L552E_EVAL COMMON
  * @brief This file provides set of firmware functions to manage Leds and push-buttons
  *        potentiometer and COM ports available on STM32L552E-EVAL board from STMicroelectronics.
  * @{
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_Defines STM32L552E_EVAL COMMON Private Defines
  * @{
  */
#if (USE_BSP_COM_FEATURE == 1)
#if (USE_COM_LOG == 1)
#define COM_POLL_TIMEOUT     1000
#endif
#endif

#if (USE_BSP_POT_FEATURE == 1)
#define POT_ADC_POLL_TIMEOUT 1000
#endif
/**
  * @}
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_Macros STM32L552E_EVAL COMMON Private Macros
  * @{
  */
#if (USE_BSP_POT_FEATURE == 1)
#define POT_CONVERT2PERC(x) (((int32_t)(x) * 100) / 0xFFF)
#endif
/**
  * @}
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_TypesDefinitions STM32L552E_EVAL COMMON Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_FunctionPrototypes STM32L552E_EVAL COMMON Private Function Prototypes
  * @{
  */
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
#if (USE_BSP_IO_CLASS == 1)
static void JOY1_EXTI_Callback(void);
#endif

#if (USE_BSP_COM_FEATURE == 1)
static void UART_MspInit(UART_HandleTypeDef *huart);
static void UART_MspDeInit(UART_HandleTypeDef *huart);
#endif

#if (USE_BSP_POT_FEATURE == 1)
static void ADC_MspInit(ADC_HandleTypeDef *hadc);
static void ADC_MspDeInit(ADC_HandleTypeDef *hadc);
#endif
/**
  * @}
  */

/** @addtogroup STM32L552E_EVAL_COMMON_Exported_Variables
  * @{
  */
#if (USE_BSP_COM_FEATURE == 1)
UART_HandleTypeDef hcom_uart[COMn];
#endif

#if (USE_BSP_POT_FEATURE == 1)
ADC_HandleTypeDef hpot_adc[POTn];
#endif
/**
  * @}
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_Variables STM32L552E_EVAL COMMON Private Variables
  * @{
  */
#if (USE_BSP_IO_CLASS == 1)
static uint16_t      LED_PIN[LEDn]  = {LED4_PIN, LED5_PIN, LED6_PIN, LED7_PIN};
static GPIO_TypeDef *LED_PORT[LEDn] = {LED4_GPIO_PORT, LED5_GPIO_PORT, 0, 0};
#else
static uint16_t      LED_PIN[LEDn]  = {LED4_PIN, LED5_PIN};
static GPIO_TypeDef *LED_PORT[LEDn] = {LED4_GPIO_PORT, LED5_GPIO_PORT};
#endif

static uint16_t           BUTTON_PIN[BUTTONn]  = {BUTTON_WAKEUP_PIN, BUTTON_TAMPER_PIN};
static GPIO_TypeDef      *BUTTON_PORT[BUTTONn] = {BUTTON_WAKEUP_GPIO_PORT, BUTTON_TAMPER_GPIO_PORT};
static IRQn_Type          BUTTON_IRQn[BUTTONn] = {BUTTON_WAKEUP_EXTI_IRQn, BUTTON_TAMPER_EXTI_IRQn};
static EXTI_HandleTypeDef hpb_exti[BUTTONn];

#if (USE_BSP_COM_FEATURE == 1)
static USART_TypeDef     *COM_UART[COMn] = {COM1_UART, COM2_UART};
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t           IsComMspCbValid[COMn] = {0U, 0U};
#endif
#if (USE_COM_LOG == 1)
static COM_TypeDef        COM_ActiveLogPort = COM1;
#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */

#if (USE_BSP_POT_FEATURE == 1)
static ADC_TypeDef      *POT_ADC[POTn] = {POT1_ADC};
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
static uint32_t          IsPotMspCbValid[POTn] = {0U};
#endif
#endif /* (USE_BSP_POT_FEATURE == 1) */

#if (USE_BSP_IO_CLASS == 1)
static uint32_t           CurrentJoyPins[JOYn]  = {0};
static uint32_t           JOY_SEL_PIN[JOYn]     = {JOY1_SEL_PIN};
static uint32_t           JOY_DOWN_PIN[JOYn]    = {JOY1_DOWN_PIN};
static uint32_t           JOY_LEFT_PIN[JOYn]    = {JOY1_LEFT_PIN};
static uint32_t           JOY_RIGHT_PIN[JOYn]   = {JOY1_RIGHT_PIN};
static uint32_t           JOY_UP_PIN[JOYn]      = {JOY1_UP_PIN};
static uint32_t           JOY_ALL_PIN[JOYn]     = {JOY1_ALL_PIN};
static EXTI_HandleTypeDef hjoy_exti[JOYn];
#endif
/**
  * @}
  */

/** @addtogroup STM32L552E_EVAL_COMMON_Exported_Functions
  * @{
  */

/**
  * @brief  This method returns the STM32L552E EVAL BSP Driver revision
  * @retval version : 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return ((int32_t)STM32L552E_EVAL_BSP_VERSION);
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardName(void)
{
  return (const uint8_t*)STM32L552E_EVAL_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board ID string
  */
const uint8_t* BSP_GetBoardID(void)
{
  return (const uint8_t*)STM32L552E_EVAL_BSP_BOARD_ID;
}

/** @addtogroup STM32L552E_EVAL_COMMON_LED_Functions
  * @{
  */

/**
  * @brief  Configure LED GPIO.
  * @param  Led Specifies the Led to be configured.
  *   This parameter can be one of following parameters:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @retval BSP error code
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t          status = BSP_ERROR_NONE;
  GPIO_InitTypeDef GPIO_Init;
#if (USE_BSP_IO_CLASS == 1)
  BSP_IO_Init_t    IO_Init;
#endif

  if ((Led == LED4) || (Led == LED5))
  {
    /* Enable the GPIO_LED Clock */
    if (Led == LED4)
    {
      LED4_GPIO_CLK_ENABLE();
    }
    else /* Led = LED5 */
    {
      LED5_GPIO_CLK_ENABLE();
    }

    /* configure the GPIO_LED pin */
    GPIO_Init.Pin   = LED_PIN[Led];
    GPIO_Init.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_Init.Pull  = GPIO_PULLUP;
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(LED_PORT[Led], &GPIO_Init);

