STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E_EVAL/stm32l552e_eval.c
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#if (USE_BSP_IO_CLASS == 1)
  else /* Led = LED6 or Led = LED7 */
  {
    /* Initialize the BSP IO driver and configure the Led pin */
    IO_Init.Pin  = LED_PIN[Led];
    IO_Init.Mode = IO_MODE_OUTPUT_PP;
    IO_Init.Pull = IO_PULLUP;
    status = BSP_IO_Init(0, &IO_Init);
    if (status == BSP_ERROR_NONE)
    {
      status = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET);
    }
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @brief  DeInitialize LEDs.
  * @param  Led LED to be de-init.
  *   This parameter can be one of the following values:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @note BSP_LED_DeInit() does not disable the GPIO clock
  * @retval BSP error code
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t          status = BSP_ERROR_NONE;
  GPIO_InitTypeDef GPIO_Init;
#if (USE_BSP_IO_CLASS == 1)
  BSP_IO_Init_t    IO_Init;
#endif

  if ((Led == LED4) || (Led == LED5))
  {
    /* DeInit the GPIO_LED pin */
    GPIO_Init.Pin = LED_PIN[Led];

    /* Turn off LED */
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
    HAL_GPIO_DeInit(LED_PORT[Led], GPIO_Init.Pin);
  }
#if (USE_BSP_IO_CLASS == 1)
  else /* Led = LED6 or Led = LED7 */
  {
    /* Just turn off the LED and reset IO pin */
    status = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET);
    if (status == BSP_ERROR_NONE)
    {
      IO_Init.Pin  = LED_PIN[Led];
      IO_Init.Mode = IO_MODE_OFF;
      IO_Init.Pull = IO_NOPULL;
      status = BSP_IO_Init(0, &IO_Init);
    }
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @brief  Turn selected LED On.
  * @param  Led Specifies the Led to be set on.
  *   This parameter can be one of following parameters:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @retval BSP error code
  */
int32_t BSP_LED_On(Led_TypeDef Led)
{
  int32_t status = BSP_ERROR_NONE;

  if ((Led == LED4) || (Led == LED5))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
#if (USE_BSP_IO_CLASS == 1)
  else
  {
    status = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET);
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @brief  Turn selected LED Off.
  * @param  Led Specifies the Led to be set off.
  *   This parameter can be one of following parameters:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @retval BSP error code
  */
int32_t BSP_LED_Off(Led_TypeDef Led)
{
  int32_t status = BSP_ERROR_NONE;

  if ((Led == LED4) || (Led == LED5))
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#if (USE_BSP_IO_CLASS == 1)
  else
  {
    status = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET);
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @brief  Toggle the selected LED.
  * @param  Led Specifies the Led to be toggled.
  *   This parameter can be one of following parameters:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @retval BSP error code
  */
int32_t BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t status = BSP_ERROR_NONE;

  if ((Led == LED4) || (Led == LED5))
  {
    HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
  }
#if (USE_BSP_IO_CLASS == 1)
  else
  {
    status = BSP_IO_TogglePin(0, LED_PIN[Led]);
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @brief  Get the state of selected LED.
  * @param  Led Specifies the Led.
  *   This parameter can be one of following parameters:
  *     @arg  LED4
  *     @arg  LED5
  *     @arg  LED6 only if IO expander is used
  *     @arg  LED7 only if IO expander is used
  * @retval 0 means off, 1 means on, negative value means error.
  */
int32_t BSP_LED_GetState(Led_TypeDef Led)
{
  int32_t status;
#if (USE_BSP_IO_CLASS == 1)
  int32_t tmp;
#endif

#if (USE_BSP_IO_CLASS == 1)
  if ((Led == LED4) || (Led == LED5))
  {
#endif
    status = (HAL_GPIO_ReadPin(LED_PORT[Led], LED_PIN[Led]) == GPIO_PIN_RESET) ? 1 : 0;
#if (USE_BSP_IO_CLASS == 1)
  }
  else
  {
    tmp = BSP_IO_ReadPin(0, LED_PIN[Led]);
    if (tmp < 0)
    {
      /* Error ocuured */
      status = tmp;
    }
    else
    {
      status = ((uint32_t) tmp == IO_PIN_RESET) ? 1 : 0;
    }
  }
#endif /* USE_BSP_IO_CLASS */

  return status;
}

/**
  * @}
  */

/** @addtogroup STM32L552E_EVAL_COMMON_BUTTON_Functions
  * @{
  */

/**
  * @brief  Configure Button GPIO and EXTI Line.
  * @param  Button Specifies the Button to be configured.
  *   This parameter should be:
  *     @arg BUTTON_WAKEUP
  *     @arg BUTTON_TAMPER
  * @param  ButtonMode Specifies Button mode.
  *   This parameter can be one of following parameters:
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with interrupt
  *                            generation capability
  * @retval BSP error code
  */
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  int32_t               status = BSP_ERROR_NONE;
  GPIO_InitTypeDef      GPIO_Init;
  uint32_t              BSP_BUTTON_IT_PRIO[BUTTONn] = {BSP_BUTTON_WAKEUP_IT_PRIORITY, BSP_BUTTON_TAMPER_IT_PRIORITY};
  uint32_t              BUTTON_EXTI_LINE[BUTTONn]   = {BUTTON_WAKEUP_EXTI_LINE, BUTTON_TAMPER_EXTI_LINE};
  BSP_EXTI_LineCallback ButtonCallback[BUTTONn]     = {BUTTON_WAKEUP_EXTI_Callback, BUTTON_TAMPER_EXTI_Callback};

  /* Enable the BUTTON clock */
  if (Button == BUTTON_WAKEUP)
  {
    BUTTON_WAKEUP_GPIO_CLK_ENABLE();
  }
  else /* BUTTON_TAMPER */
  {
    BUTTON_TAMPER_GPIO_CLK_ENABLE();
  }

  GPIO_Init.Pin   = BUTTON_PIN[Button];
  GPIO_Init.Pull  = GPIO_NOPULL;
  GPIO_Init.Speed = GPIO_SPEED_FREQ_HIGH;

  if (ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    GPIO_Init.Mode = GPIO_MODE_INPUT;
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_Init);
  }

  if (ButtonMode == BUTTON_MODE_EXTI)
  {
    /* Configure Button pin as input with External interrupt */
    GPIO_Init.Mode = GPIO_MODE_IT_RISING;
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_Init);

