STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E_EVAL/stm32l552e_eval.c
  return status;
}

/**
  * @brief  DeInitialize Potentiometer.
  * @param  POT Potentiometer to be de_init.
  *          This parameter can be POT1
  * @retval BSP error code
  */
int32_t BSP_POT_DeInit(POT_TypeDef POT)
{
  int32_t status = BSP_ERROR_NONE;

  /* POT de-init */
  hpot_adc[POT].Instance = POT_ADC[POT];
  if (HAL_ADC_DeInit(&hpot_adc[POT]) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
  else
  {
    ADC_MspDeInit(&hpot_adc[POT]);
  }
#endif

  return status;
}

/**
  * @brief  Get Potentiometer level.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @retval Potentiometer level(0..100%), negative value means error.
  */
int32_t BSP_POT_GetLevel(POT_TypeDef POT)
{
  int32_t  retval = BSP_ERROR_PERIPH_FAILURE;
  uint32_t AdcValue;

  if (HAL_ADC_Start(&hpot_adc[POT]) == HAL_OK)
  {
    if (HAL_ADC_PollForConversion(&hpot_adc[POT], POT_ADC_POLL_TIMEOUT) == HAL_OK)
    {
      AdcValue = HAL_ADC_GetValue(&hpot_adc[POT]);
      retval = POT_CONVERT2PERC(AdcValue);
    }
  }

  return retval;
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register default POT msp callbacks.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @retval BSP status.
  */
int32_t BSP_POT_RegisterDefaultMspCallbacks(POT_TypeDef POT)
{
  int32_t status = BSP_ERROR_NONE;

  /* Register MspInit/MspDeInit callbacks */
  if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, ADC_MspInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  } 
  else if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, ADC_MspDeInit) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    IsPotMspCbValid[POT] = 1U;
  }
  /* Return BSP status */
  return status;
}

/**
  * @brief  Register BSP POT msp callbacks.
  * @param  POT Potentiometer.
  *          This parameter can be POT1
  * @param  CallBacks Pointer to MspInit/MspDeInit callback functions.
  * @retval BSP status
  */
int32_t BSP_POT_RegisterMspCallbacks(POT_TypeDef POT, BSP_POT_Cb_t *CallBacks)
{
  int32_t status = BSP_ERROR_NONE;

  if (CallBacks == NULL)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit callbacks */
    if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
  }
  /* Return BSP status */
  return status; 
}
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Initialize ADC1.
  * @param  hadc ADC handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_ADC1_Init(ADC_HandleTypeDef* hadc)
{
  HAL_StatusTypeDef        status = HAL_ERROR;
  ADC_ChannelConfTypeDef   CHANNEL_Config;
  uint32_t                 POT_ADC_CHANNEL[POTn] = {POT1_ADC_CHANNEL};
  
  /* ADC configuration */
  hadc->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc->Init.Resolution            = ADC_RESOLUTION_12B;
  hadc->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc->Init.ScanConvMode          = ADC_SCAN_DISABLE;
  hadc->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
  hadc->Init.LowPowerAutoWait      = DISABLE;
  hadc->Init.ContinuousConvMode    = DISABLE;
  hadc->Init.NbrOfConversion       = 1;
  hadc->Init.DiscontinuousConvMode = DISABLE;
  hadc->Init.NbrOfDiscConversion   = 1;
  hadc->Init.ExternalTrigConv      = ADC_SOFTWARE_START;
  hadc->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc->Init.DMAContinuousRequests = DISABLE;
  hadc->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
  hadc->Init.OversamplingMode      = DISABLE;
  hadc->Init.DFSDMConfig           = ADC_DFSDM_MODE_DISABLE;
  if (HAL_ADC_Init(hadc) == HAL_OK)
  {
    /* ADC channel configuration */
    CHANNEL_Config.Channel      = POT_ADC_CHANNEL[POT1];
    CHANNEL_Config.Rank         = ADC_REGULAR_RANK_1;
    CHANNEL_Config.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;
    CHANNEL_Config.SingleDiff   = ADC_SINGLE_ENDED;
    CHANNEL_Config.OffsetNumber = ADC_OFFSET_NONE;
    CHANNEL_Config.Offset       = 0;
    if (HAL_ADC_ConfigChannel(hadc, &CHANNEL_Config) == HAL_OK)
    {
      if (HAL_ADCEx_Calibration_Start(hadc, ADC_SINGLE_ENDED) == HAL_OK)
      {
        status = HAL_OK;
      }
    }
  }

  return status;
}

/**
  * @}
  */
#endif /* (USE_BSP_POT_FEATURE == 1) */

#if (USE_BSP_IO_CLASS == 1)
/** @addtogroup STM32L552E_EVAL_COMMON_JOY_Functions
  * @{
  */

/**
  * @brief  Configure Joystick.
  * @param  JOY Joystick to be configured.
  *   This parameter can be JOY1
  * @param  JoyMode Specifies joystick mode.
  *   This parameter can be one of following parameters:
  *     @arg JOY_MODE_GPIO: Joystick pin will be used as simple IO
  *     @arg JOY_MODE_EXTI: Joystick pin will be connected to EXTI line with
  *                         interrupt generation capability
  * @param  JoyPins Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  *     @arg JOY_ALL: all pins
  * @retval BSP error code
  */
int32_t BSP_JOY_Init(JOY_TypeDef JOY, JOYMode_TypeDef JoyMode, JOYPin_TypeDef JoyPins)
{
  int32_t               status = BSP_ERROR_NONE;
  uint32_t              JOY_EXTI_LINE[JOYn] = {JOY1_EXTI_LINE};
  BSP_EXTI_LineCallback JoyCallback[JOYn]   = {JOY1_EXTI_Callback};
  BSP_IO_Init_t         IO_Init;

  /* Initialize the BSP IO driver and configure the joystick pin */
  switch (JoyPins)
  {
    case JOY_SEL:
      IO_Init.Pin = JOY_SEL_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_SEL_PIN[JOY];
      break;
    case JOY_DOWN:
      IO_Init.Pin = JOY_DOWN_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_DOWN_PIN[JOY];
      break;
    case JOY_LEFT:
      IO_Init.Pin = JOY_LEFT_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_LEFT_PIN[JOY];
      break;
    case JOY_RIGHT:
      IO_Init.Pin = JOY_RIGHT_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_RIGHT_PIN[JOY];
      break;
    case JOY_UP:
      IO_Init.Pin = JOY_UP_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_UP_PIN[JOY];
      break;
    case JOY_ALL:
      IO_Init.Pin = JOY_ALL_PIN[JOY];
      CurrentJoyPins[JOY] |= JOY_ALL_PIN[JOY];
      break;
    default :
      status = BSP_ERROR_WRONG_PARAM;
      break;
  }

  if (status == BSP_ERROR_NONE)
  {
    IO_Init.Mode = (JoyMode == JOY_MODE_GPIO) ? IO_MODE_INPUT : IO_MODE_IT_FALLING_EDGE;
    IO_Init.Pull = IO_PULLUP;
    status = BSP_IO_Init(0, &IO_Init);
    if ((status == BSP_ERROR_NONE) && (JoyMode == JOY_MODE_EXTI))
    {
      /* Interrupt already enabled on BSP_IO_Init, just register callback */
      if (HAL_EXTI_GetHandle(&hjoy_exti[JOY], JOY_EXTI_LINE[JOY]) == HAL_OK)
      {
        if (HAL_EXTI_RegisterCallback(&hjoy_exti[JOY], HAL_EXTI_RISING_CB_ID, JoyCallback[JOY]) != HAL_OK)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
      }
      else
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }

