STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E_EVAL/stm32l552e_eval.c
  }

  return status;
}

/**
  * @brief  De-initialize Joystick.
  * @param  JOY Joystick to be de-init.
  *   This parameter can be JOY1
  * @param  JoyPins Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  *     @arg JOY_ALL: all pins
  * @retval BSP error code
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  int32_t       status = BSP_ERROR_NONE;
  BSP_IO_Init_t IO_Init;

  switch (JoyPins)
  {
    case JOY_SEL:
      IO_Init.Pin = JOY_SEL_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_SEL_PIN[JOY]);
      break;
    case JOY_DOWN:
      IO_Init.Pin = JOY_DOWN_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_DOWN_PIN[JOY]);
      break;
    case JOY_LEFT:
      IO_Init.Pin = JOY_LEFT_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_LEFT_PIN[JOY]);
      break;
    case JOY_RIGHT:
      IO_Init.Pin = JOY_RIGHT_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_RIGHT_PIN[JOY]);
      break;
    case JOY_UP:
      IO_Init.Pin = JOY_UP_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_UP_PIN[JOY]);
      break;
    case JOY_ALL:
      IO_Init.Pin = JOY_ALL_PIN[JOY];
      CurrentJoyPins[JOY] &= ~(JOY_ALL_PIN[JOY]);
      break;
    default :
      status = BSP_ERROR_WRONG_PARAM;
      break;
  }
  if (status == BSP_ERROR_NONE)
  {
    IO_Init.Mode = IO_MODE_OFF;
    IO_Init.Pull = IO_NOPULL;
    status = BSP_IO_Init(0, &IO_Init);
  }

  return status;
}

/**
  * @brief  Get Joystick state.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @retval BSP error code if value negative or one of following value:
  *     @arg JOY_NONE
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  int32_t retval = (int32_t)JOY_NONE;
  int32_t status;

  if ((CurrentJoyPins[JOY] & JOY_SEL_PIN[JOY]) == JOY_SEL_PIN[JOY])
  {
    /* Read status of JOY_SEL */
    status = BSP_IO_ReadPin(0, JOY_SEL_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_SEL : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_UP_PIN[JOY]) == JOY_UP_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_UP */
    status = BSP_IO_ReadPin(0, JOY_UP_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_UP : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_DOWN_PIN[JOY]) == JOY_DOWN_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_DOWN */
    status = BSP_IO_ReadPin(0, JOY_DOWN_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_DOWN : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_LEFT_PIN[JOY]) == JOY_LEFT_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_LEFT */
    status = BSP_IO_ReadPin(0, JOY_LEFT_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_LEFT : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }
  if (((CurrentJoyPins[JOY] & JOY_RIGHT_PIN[JOY]) == JOY_RIGHT_PIN[JOY]) && (retval == (int32_t)JOY_NONE))
  {
    /* Read status of JOY_RIGHT */
    status = BSP_IO_ReadPin(0, JOY_RIGHT_PIN[JOY]);
    if (status >= 0)
    {
      retval = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_RIGHT : (int32_t)JOY_NONE;
    }
    else
    {
      retval = status;
    }
  }

  return retval;
}

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick to be de-init.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}

/**
  * @brief  BSP JOY interrupt handler.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @param  JoyPin Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  * @retval None.
  */
void BSP_JOY_IRQHandler(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JoyPin);

  HAL_EXTI_IRQHandler(&hjoy_exti[JOY]);
}

/**
  * @}
  */
#endif /* (USE_BSP_IO_CLASS == 1) */

/**
  * @}
  */

/** @defgroup STM32L552E_EVAL_COMMON_Private_Functions STM32L552E_EVAL COMMON Private Functions
  * @{
  */

/**
  * @brief  Wakeup EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_WAKEUP_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_WAKEUP);
}

/**
  * @brief  Tamper EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_TAMPER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_TAMPER);
}

#if (USE_BSP_IO_CLASS == 1)
/**
  * @brief  Joystick1 EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_EXTI_Callback(void)
{
  int32_t ItStatus;

  if ((CurrentJoyPins[JOY1] & JOY_SEL_PIN[JOY1]) == JOY_SEL_PIN[JOY1])
  {
    /* Read IT status of JOY_SEL */
    ItStatus = BSP_IO_GetIT(0, JOY_SEL_PIN[JOY1]);
    if (ItStatus == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_SEL);
      /* Clear IT status of JOY_SEL */
      ItStatus = BSP_IO_ClearIT(0, JOY_SEL_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_UP_PIN[JOY1]) == JOY_UP_PIN[JOY1])
  {
    /* Read IT status of JOY_UP */
    ItStatus = BSP_IO_GetIT(0, JOY_UP_PIN[JOY1]);
    if (ItStatus == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_UP);
      /* Clear IT status of JOY_UP */
      ItStatus = BSP_IO_ClearIT(0, JOY_UP_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_DOWN_PIN[JOY1]) == JOY_DOWN_PIN[JOY1])
  {
    /* Read IT status of JOY_DOWN */
    ItStatus = BSP_IO_GetIT(0, JOY_DOWN_PIN[JOY1]);
    if (ItStatus == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_DOWN);
      /* Clear IT status of JOY_DOWN */
      ItStatus = BSP_IO_ClearIT(0, JOY_DOWN_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_LEFT_PIN[JOY1]) == JOY_LEFT_PIN[JOY1])
  {
    /* Read IT status of JOY_LEFT */
    ItStatus = BSP_IO_GetIT(0, JOY_LEFT_PIN[JOY1]);
    if (ItStatus == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_LEFT);
      /* Clear IT status of JOY_LEFT */
      ItStatus = BSP_IO_ClearIT(0, JOY_LEFT_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_RIGHT_PIN[JOY1]) == JOY_RIGHT_PIN[JOY1])
  {
    /* Read IT status of JOY_RIGHT */
    ItStatus = BSP_IO_GetIT(0, JOY_RIGHT_PIN[JOY1]);
    if (ItStatus == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_RIGHT);
      /* Clear IT status of JOY_RIGHT */
      ItStatus = BSP_IO_ClearIT(0, JOY_RIGHT_PIN[JOY1]);
      if (ItStatus < 0)
      {
        /* Nothing to do */
      }
    }
  }
}
#endif

